{
  "filename": "MacLeod et al. - 2022 - A self-driving laboratory advances the Pareto front for material properties.pdf",
  "metadata": {
    "title": "A self-driving laboratory advances the Pareto front for material properties",
    "authors": [
      "Benjamin P. MacLeod",
      "Fraser G. L. Parlane",
      "Connor C. Rupnow1",
      "Kevan E. Dettelbach",
      "Michael S. Elliott",
      "Thomas D. Morrissey ",
      "Ted H. Haley",
      "Oleksii Proskurin",
      "Michael B. Rooney",
      "Nina Taherimakhsousi",
      "David J. Dvorak",
      "Hsi N. Chiu",
      "Christopher E. B. Waizenegger",
      "Karry Ocean",
      "Mehrdad Mokhtari",
      "Curtis P. Berlinguette"
    ],
    "arxiv_id": ""
  },
  "sections": {
    "Preamble": "",
    "A self-driving laboratory advances the Pareto front for material properties": "",
    "Abstract": "Useful materials must satisfy multiple objectives, where the optimization of one objective is often at the expense of another. The Pareto front reports the optimal trade-offs between these conflicting objectives. Here we use a self-driving laboratory, Ada, to define the Pareto front of conductivities and processing temperatures for palladium films formed by combustion synthesis. Ada discovers new synthesis conditions that yield metallic films at lower processing temperatures (below 200 °C) relative to the prior art for this technique (250 °C). This temperature difference makes possible the coating of different commodity plastic materials (e.g., Nafion, polyethersulfone). These combustion synthesis conditions enable us to to spray coat uniform palladium films with moderate conductivity (1.1 × 105 S m−1 ) at 191 °C. Spray coating at 226 °C yields films with conductivities (2.0 × 106 S m−1 ) comparable to those of sputtered films (2.0 to 5.8 × 106 S m−1 ). This work shows how a self-driving laboratoy can discover materials that provide optimal trade-offs between conflicting objectives.",
    "Introduction": "Self-driving laboratories combine automation and artificial intelligence to accelerate the discovery and optimization of materials1,2,3. The increasing flexibility of laboratory automation is enabling self-driving laboratories to manipulate and measure a broader set of experimental variables4. Consequently, a growing number of self-driving laboratories are being developed across a range of fields.While many self-driving laboratories are able to test multiple experimental variables, most optimize for only a single objective (e.g., process parameter, material property). This situation is not consistent with most practical applications, where multiple objectives need to be simultaneously optimized. Consider, for example, how a solar cell must be optimized for voltage, current, and fill factor to yield a high power conversion efficiency; how an electrolyzer must form products at low voltages and high reaction rates and selectivities38; and, how structural alloys are optimized for both strength and toughness31,35. These and other applications motivate the emerging use of self-driving laboratories for multiobjective optimizationThe optimization of materials for multiple objectives can be challenging because improving one objective often compromises another (e.g., decreasing the bandgap of the light-absorbing material in a photovoltaic cell increases the photocurrent but decreases the voltage). As a result, there is often no single champion material, but rather a set of materials exhibiting trade-offs between objectives (Fig. 1). The set of materials with the best possible trade-offs lie at the Pareto front. Materials on the Pareto front cannot be improved for one objective without compromising one or more other objectives. Most self-driving laboratories used for multiobjective optimization, however, identify only a single optimal material based on preferences specified in advance of the experiment.Here, we use a self-driving laboratory to map out an entire Pareto front. We apply this approach to thin film materials for the first time by mapping out a trade-off between film conductivity and processing temperature. In doing so, our self-driving laboratory identifies previously untested conditions that decrease the temperature required for the combustion synthesis of palladium films from 250 to 190°C. This finding increases the scope of polymeric substrates that palladium can be deposited on by combustion synthesis to include Nafion, polyethersulfone, and heat-stabilized polyethylene napththalate. Our self-driving laboratory also identifies conditions suitable for spray coating homogeneous films on larger substrates with conductivities approaching those of films made by vacuum deposition methods. The approach presented here is highly relevant to the materials sciences because it identifies optimal materials for every preferred tradeoff between objectives.",
    "Results": "Autonomously discovering a Pareto front. We upgraded the\nhardware and software of our existing self-driving laboratory,\nAda8, (Fig. 2) to study the combustion synthesis of conducting\npalladium films. This upgraded self-driving laboratory was\ndesigned to map out a Pareto front that shows the tradeoff\nbetween the temperature at which the films are processed and the\nfilm conductivity. We selected combustion synthesis as an optimization problem because it is a solution-based method for\nmaking functional metal coatings. This method, however, has not\nyet been scaled and has not been proven for making high-quality,\nconductive metal films40,43,44. Combustion synthesis can form\ncoatings at lower temperatures, enabling the potential use of\ninexpensive polymeric substrates45,46, but film conductivity\ntypically decreases with processing temperature43. This situation\npresents a trade-off: to what extent can the conductivity be\nmaximized while the processing temperature is minimized? The\nanswer to this question would enable the researcher to determine,\nfor example, what types of substrates could be layered with a\nmetal coating of certain conductivity. We therefore leveraged Ada\nto effectively study the numerous compositional47,48 and processing variables43,49 that influence processing temperatures and\nthe corresponding conductivities.\nFor this study we configured Ada to manipulate four variables:\nfuel identity, fuel-to-oxidizer ratio, precursor solution concentration, and annealing temperature (Fig. 3a). We confined the study\nto mixtures of two fuels, glycine and acetylacetone, that we\nindependently identified to yield conductive films at temperatures\nbelow 300 °C. The fuel-to-oxidizer ratio was varied because it\ncontrols product oxidation in bulk combustion syntheses50,51.\nThe precursor concentration influences the morphology of the\ndrop-casted films. Finally, we varied the processing temperature\nwhich may influence the conductivity through solvent removal,\nprecursor decomposition, film densification, impurity removal,\ngrain growth, oxidation, or cracking52–54.\nFlexible automation4 enabled us to upgrade Ada (Fig. 2a) by\ncoupling a larger, 6-axis robot to the existing smaller, 4-axis\nrobot. The smaller robot (Fig. 2b) deposited and characterized the\nthin films8, while the larger robot transported the samples to a\ncommercial X-ray fluorescence (XRF) microscope for elemental\nanalysis. These two robots jointly executed a 7-step experimental\nworkflow (Fig. 2c, see “Methods” section). First, a combustion\nsynthesis precursor solution was formulated from stock solutions\nand then drop-cast onto a glass microscope slide. The resulting\nprecursor droplet was imaged and then annealed in a forcedconvection oven to form a film. The film was subsequently\ncharacterized by XRF microscopy, imaging, and 4-point probe\nconductance mapping. The conductivity of each film was\ndetermined by combining the conductance with a film thickness\nestimated by XRF (see “Autonomous workflow step 7” in\n“Methods” section, Supplementary Fig. 2). Finally, the conductivity and processing temperature for each film were passed to a\nmultiobjective Bayesian optimization algorithm55 to plan the next\nexperiment based on all the available data (see “Autonomous\nworkflow step 8” in “Methods” section). The algorithm we used is\ncalled q-expected hypervolume improvement (qEHVI)55. All of the steps in the autonomous workflow were performed\nwithout human intervention at a typical rate of two samples an\nhour. Ada could run unattended for 40–60 experiments until the\nnecessary consumables (e.g., pipettes tips, mixing vials, glass\nsubstrates, and precursors; see “Methods” section) were\nexhausted. We used Ada to execute a total of 253 combustion\nsynthesis experiments that explored a wide range of pertinent\ncomposition and processing variables.\nThe qEHVI algorithm is one of a number of a posteriori\nmultiobjective optimization algorithms designed to identify the\nPareto front55–58. These multiobjective optimization methods are\nknown as a posteriori methods because preferred solutions are\nselected after the optimization. We chose to use an a posteriori\nmethod for this exploratory study, because we sought to identify a\nrange of Pareto-optimal outcomes rather than a single optimal\npoint. We selected the qEHVI algorithm because previously\nreported benchmarks show that the qEHVI algorithm often\nresolves the Pareto front in fewer experiments than other\nalgorithms.55\nThe qEHVI algorithm directed our self-driving laboratory to\nquantify the trade-off between film conductivity and annealing\ntemperature (Fig. 3). We manually selected eight synthesis\nconditions spanning most of the design space to provide\ninitialization data for the qEHVI algorithm (Supplementary\nTable 1). After executing these initial experiments, Ada executed\nmore than 50 iterative qEHVI-guided experiments to map the\nPareto front of annealing temperature and conductivity. We\nperformed this autonomous optimization campaign in quadruplicate. Each replicate generated a Pareto front showing a clear\ntrade-off between temperature and conductivity (Fig. 3b).\nThe synthesis conditions tested during the optimization are\nshown in Fig. 3a; the conditions that created materials on the\nPareto front are highlighted. The data revealed that the optimal\nprecursors typically were those of concentrations near 6 mg mL−1,\nfuel-to-oxidizer ratios below 1, and fuel blends consisting\nprimarily of acetylacetone. Notably, our experiments did not\nreveal a single optimal synthesis condition. The conditions\nrequired to obtain the maximum conductivity depended in part on the annealing temperature. Specifically, conductive films\ncreated below 200 °C required precursors with predominantly\nacetylacetone fuel. At higher temperatures, however, glycine-rich\nfuel blends also yielded samples on the Pareto front. The data\nshows how the fuel-to-oxidizer ratio could vary widely for fuels\nrich in acetylacetone yet still yield films on the Pareto front. The\nPareto-optimal samples resulting from glycine-rich fuel blends,\nhowever, did not exhibit a wide range of fuel to oxidizer values.\nThese observations highlight the richness of the data generated by\nthe self-driving laboratory.",
    "Quantification of algorithm performance": "We used computer\nsimulations to quantify the benefit of the qEHVI algorithm\nrelative to random search (an open-loop sampling technique that\ndoes not use feedback from the experiment to determine which\nexperiment to do next). These simulations were performed by\nrunning both the random and qEHVI sampling techniques on a\nresponse surface fit to the experimental data (see “Methods”\nsection). Scenarios with and without experimental noise were\nsimulated by adding synthetic noise to the response surface as\nappropriate (see “Models of the experimental response surface\nand noise” in “Methods” section).The hypervolume (i.e., the area\nunder the Pareto front) was used to measure the progress of\noptimization (Fig. 4a). We used acceleration factor (Fig. 4b) and\nenhancement factor (Fig. 4c) to compare our closed-loop sampling using qEHVI to open-loop sampling using random search;\nsee “Methods” section59. In a noise-free scenario, qEHVI required\nless than 100 samples to outperform 10,000 random samples\n(Fig. 4a). The performance of the qEHVI algorithm degraded in\nthe presence of simulated experimental noise (see “Methods”\nsection), but still exceeded the performance of random search.\nThis performance decrease due to noise emphasizes the importance of minimizing experimental noise when developing a selfdriving experiment. Benchmarks comparing other closed-loop\nand open-loop sampling techniques yielded similar results (see\nSupplementary Fig. 11). These findings highlight how self-driving\nlaboratories can effectively search large materials design spaces\nwithout requiring extremely high throughput.",
    "Translation of discovery to a scalable manufacturing process": "The practical application of combustion synthesis would require\nthe deposition of uniform films over large areas that are inaccessible to drop casting. On this basis, we set out to combine\npalladium combustion synthesis with ultrasonic spray coating60.\nWe sprayed precursors directly onto a preheated glass substrate60\n(Fig. 5a, see “Methods” section). The precursors decomposed in\nless than five minutes to yield reflective, conductive palladium\nfilms (Fig. 5b). An XRF map of the films (Fig. 5c) showed\nimproved homogeneity relative to the drop-cast films (Fig. 2b).\nWe performed additional spray coating experiments to verify\nthat the trends observed in the autonomous optimization\ntranslate to spray coating (i.e., that conductive palladium films\ncan be obtained below 200 °C and that the film conductivity\nincreases with temperature). Specifically, we spray coated\npalladium films using three recipes from the autonomously\nidentified Pareto front, with temperatures of 191, 200, and 226 °C\n(Fig. 6 and Supplementary Table 2). Triplicate samples were spray\ncoated using each recipe. All three recipes yielded films\napproximately 50–60 nm thick, as measured by XRF microscopy\n(see “Methods” section). All the films were relatively uniform,\nwith spatial variations in the film thickness less than 5% of the\nmean within an 8 mm × 20 mm region at the center of each\nsample (see “Methods” section and Supplementary Table 3).\nSpatial variations in the conductivity within the same region were\nmeasured using the robot and were less than 18% of the mean for\nall samples (see “Methods” section and Supplementary Table 3).\nThe film conductivity of the lowest temperature recipe\n(T = 191 °C) was 1.1 × 105 S m−1, which is approximately 1% of the bulk conductivity of palladium61. The film conductivity can\nincrease by more than an order of magnitude when the spray\ncoating temperature is increased by 35 °C. The highest temperature recipe tested (T = 226 °C) yielded palladium films with a\nconductivity of 2.0 × 106 S m−1, which is comparable to the\nconductivities of sputtered palladium films reported in the\nliterature (2.0–5.8 × 106 S m−1; Fig. 6)62–64. These findings create\nnew opportunities to deposit palladium films without vacuum\nonto large-area substrates, including an expanded range of\ntemperature-sensitive polymers (e.g., Nafion41, polyethersulfone42,\nand heat-stabilized polyethylene naphthalate42). One application\nof this deposition process could be the fabrication of large,\nsupported palladium membranes for more cost-effective electrocatalytic palladium membrane reactors65.",
    "Discussion": "Here, we mapped out a Pareto front between film processing\ntemperature and conductivity using a self-driving laboratory\nguided by the qEHVI multi-objective optimization algorithm.\nThis tradeoff is just one example of the conflicting objectives\nroutinely faced by materials scientists to which our method could\nbe applied. Our approach eliminates the need for the researcher\nto specify preferences between competing objectives in advance of\nthe experiment, and also produces a richer, more valuable data\nset. In this case, the temperature–conductivity Pareto front is\nmore useful than optimizing conductance for a fixed temperature\nlimit because processing temperature limits vary depending on\nthe application. Our self-driving laboratory also identified\nsynthesis conditions that translated to a scalable spray-coating\nmethod for depositing high-quality, high-conductivity palladium\nfilms at temperatures above 190 °C. This work shows how selfdriving laboratories can potentially accelerate the translation of\nmaterials to industry, where satisfying multiple objectives is\nessential ",
    "Methods": "Materials. MeCN (CAS 75-05-8; high-performance liquid chromatography\n(HPLC) grade, ≥99.9% purity), glycine (CAS 56-40-6, ACS reagent grade, >98.5%\npurity) and acetylacetone (CAS 123-54-6; ≥99% purity) were purchased from\nSigma-Aldrich. Urea (CAS 57-13-6, ultra-pure; heavy metal content 0.01 ppm) was\npurchased from Schwarz/Mann. Palladium(II) nitrate hydrate (Pd(NO3)2•H2O; Pd\n~40% m/m; 99.9% Pd purity, CAS 10102-05-3) was purchased from Strem Chemicals, Inc. All chemicals were used as received without further purification. Manual preparation of stock solutions. The self-driving laboratory is provided\nwith starting materials in the form of stock solutions which are prepared manually\nand then placed in capped 2 mL HPLC vials in a tray where they can be accessed by\nthe self-driving laboratory. All solutions were prepared at a concentration of\n12 mg mL−1. The Pd(NO3)2•H2O solution was prepared using MeCN as a solvent\nwhile all other solutions were prepared using deionized H2O.\nPreparation of glass substrates and other consumables. In addition to stock\nsolutions, the self-driving laboratory uses consumable glass substrates (75 mm ×\n25 mm × 1 mm microscope slides; VWR catalog no. 16004-430), 2 mL HPLC vials\n(Canadian Life Science), and 200 µL pipettes (Biotix, M-0200-BC). These are placed\nin appropriate racks and trays for access by the robotics.\nThe HPLC vials and pipettes were used as received, whereas the microscope\nslides were cleaned by sequential sonication in detergent, deionized water, acetone,\nand isopropanol for 10 min each8. Wells of 18 mm diameter were then created on\nthe microscope slides using a sprayed enamel coating (DEM-KOTE enamel finish)\nand circular masks placed at the center of each slide (Supplementary Fig. 1). The\nwells serve to confine the precursor solution before it dries.\nSelf-driving laboratory. The self-driving laboratory consists of a precision 4-axis\nlaboratory robot (N9, North Robotics) coupled with a 6-axis collaborative robot\n(UR5e, Universal Robotics). The 4-axis robot is equipped to perform entire thin\nfilm deposition and characterization workflows and is described in our previous\nwork8. The 6-axis robot enables samples to be transferred to a variety of additional\nmodules, including the XRF microscope used here. Both robots are equipped with\nvacuum-based tools for substrate handling. All robots and instruments were\ncontrolled by a PC with software written in Python.\nOverview of autonomous robotic workflow. The majority of operations in the\nautonomous robotic workflow are performed by the 4-axis laboratory robot.\nSamples are transported between the 4-axis robot and the XRF microscope by the\n6-axis robot.\nThe 4-axis robot prepared each sample by combining stock solutions to form a\nprecursor mixture, drop casting this precursor onto a glass slide, and then\nannealing the sample in a forced convection oven (Supplementary Fig. 1). The\nsamples were characterized by white light photography before and after annealing,\nX-ray fluorescence microscopy, and 4-point-probe conductance measurements.\nThe resulting data was then automatically analyzed using a custom data pipeline\nimplemented in Python. Finally, the result of the experiment was fed to a Bayesian\noptimizer which used an expected hypervolume improvement acquisition function\nto select the next experiment to be performed. Each of these steps is described in\nfurther detail below.\nAutonomous workflow step 1: mix precursors. The 4-axis robot formulated each\nprecursor by pipetting varying volumes of the stock solutions described above into\na clean 2 mL HPLC vial. Gravimetric feedback from an analytical balance (ZSA120,\nScientech) was used to minimize and record pipetting errors. The precursor was\nmixed by repeated aspiration and dispensing.\nAutonomous workflow step 2: drop cast precursor. The 4-axis robot used a\nvacuum-based substrate handling tool to place a clean glass slide onto a tray. This\nrobot then created a thin film sample by using a pipette to drop cast 98 µL of the\nprecursor into a predefined well on the slide. The solution was ejected from the\npipette at a rate of 5 µL s−1 from a height of approximately 1.5 mm above the top\nsurface of the substrate.\nAutonomous workflow step 3: image precursor droplet. The 4-axis robot\nacquired visible-light photographs of each sample before annealing. This robot\npositioned samples 90 mm below a camera (FLIR Blackfly S USB3; BFS-U3-\n120S4C-CS) using a Sony 12.00 MP CMOS sensor (IMX226) and an Edmund\nOptics 25 mm C Series Fixed Focal Length Imaging Lens (#59–871). The C-mount\nlens was connected to the CS-mount camera using a Thorlabs CS- to C-Mount\nExtension Adapter, 1.00″-32 Threaded, 5 mm Length (CML05). The sample was\nilluminated from the direction of the camera using a MIC-209 3-W ring light. For\nimaging, the lens was opened to f/1.4, and black flocking paper (Thorlabs BFP1)\nwas placed 10 cm behind the sample.\nAutonomous workflow step 4: annealing. After drop casting, the 4-axis robot\nused the substrate handling tool to transport the precursor-coated slide into a\npurpose-built miniature convection oven for annealing at a variable temperature\nbetween 180 and 280 °C. The most important features of the oven are a lowthermal mass construction (lightweight aluminum frame with glass-fiber insulation) and internal and external fans. These features enable rapid heating and\ncooling of the sample (Supplementary Fig. 12). A pneumatically actuated lid\nenables robotic access to the sample. The oven employs a ceramic heating element\n(P/N 3559K23, McMaster Carr) controlled by a PID temperature controller (P/N\nCN7523, Omega Engineering). A type-K thermocouple located in the oven air\nspace provides temperature feedback to the controller. In the experiments performed here, the sample was inserted into the oven which was then ramped at\n40 °C per minute to the temperature set point, which was then held for 450 s. Upon\ncompletion of the hold, the oven lid was opened and a cooling fan turned on to\nblow ambient temperature air through the oven and over the sample. The sample\nwas removed from the oven after the temperature dropped below 60 °C. The oven\nwas further cooled to below 40 °C prior to loading of the next sample.\nAutonomous workflow step 5: XRF imaging and data analysis. The self-driving\nlaboratory acquired hyperspectral X-ray fluorescence (XRF) images of each sample\nusing a Bruker M4 TORNADO X-ray fluorescence microscope equipped with a\ncustomized sample fixture. Samples were transported to the XRF microscope by the\nUR5e 6-axis robotic arm equipped with a vacuum-based substrate handling tool\nsimilar to the one used by the 4-axis N9 robot. A dedicated exchange tray accessible\nto both robots enabled samples to be passed from one robot to the other.\nThe XRF microscope has a rhodium X-ray source operated at 50 kV/600 µA/\n30 W and polycapillary X-ray optics yielding a 25 µm spot size on the sample. The\ninstrument employs twin 30 mm2 silicon drift detectors and achieves an energy\nresolution of 10 eV. Hyperspectral images were taken over a 20 mm × 20 mm area\nat a resolution of 125 × 125 pixels. The XRF spectra obtained (reported in counts)\nwere scaled by the integration time (50 ms) and the energy resolution (10 eV) to\nyield units of counts s−1 eV−1.\nTo quantify the relative amount of palladium in the film, the palladium Lymanalpha X-ray fluorescence line (2.837 keV) was integrated from 2.6 to 3.2 keV. The\nresulting counts were converted to film thickness estimates by applying a\ncalibration factor obtained using reference samples (see below). Ninety-seven\npoints of interest are defined within the XRF hypermap of the sample, as defined in\nSupplementary Fig. 3. For each point of interest, the average XRF counts\nper second were calculated over a 3 mm × 3 mm area.\nAutonomous workflow step 6: image annealed film. The self-driving laboratory\nacquired visible light photographs (as described in step 3) of each sample after\nannealing.\nAutonomous workflow step 7: film conductivity measurement. After hyperspectral XRF imaging, the sample was returned by the UR5e robot to the N9 robot for\nfilm conductance measurements. Four-point probe conductance measurements were\nperformed with a Keithley Series K2636B System Source Meter instrument connected\nto a Signatone four-point probe head (part number SP4-40045TBN; 0.040-inch tip\nspacing, 45 g pressure, and tungsten carbide tips with 0.010-inch radii) by a Signatone\ntriax to BNC feedthrough panel (part number TXBA-M160-M). The source current\nwas stepped from 0 to 1 mA in 0.2 mA steps. After each current step, the source meter\nwas stabilized for 0.1 s and the voltage across the inner probes was then averaged for\nthree cycles of the 60 Hz power line (i.e., for 0.05 s) and recorded. Conductance measurements were made on the same 97 points of interest as analyzed in the XRF\ndata, as defined in Supplementary Fig. 3.\nThe film conductivity was calculated using a custom data analysis pipeline\nimplemented in Python using the open-source Luigi framework66. This pipeline\ncombined conductance data and XRF data to estimate the film conductivity at each\nof the 97 points of interest on the sample.\nFor each set of current–voltage measurements at each position on each sample,\nthe RANSAC robust linear fitting algorithm67 was used to extract the conductance\n(dI/dV). The voltage compliance limit of the K2636B was set to 10 V and voltage\nmeasurements greater than 10 V were therefore considered to have saturated the\nSource Meter instrument and automatically discarded by the data analysis pipeline.\nThe conductivity of the thin films was then calculated by combining the 4-\npoint-probe conductance data with the film thicknesses estimated by XRF:\nσ ¼ ln2\nπ ´ dI\ndV ´ t\n1\n; ð1Þ\nwhere dI/dV is the conductance from the 4-point-probe measurement, t is\nestimated film thickness from the XRF measurements, and σ is conductivity.\nDue to the poor morphology of the drop-cast films, a robust conductivity\nestimation scheme was employed. First, conductance data was excluded for any\nmeasurement positions with zero conductance. Next, outliers were excluded from\nthe remaining conductance data using a kernel density exclusion method (see\nbelow). Outliers were also excluded from the XRF film thickness estimates using\nthe same exclusion method. Conductivities were calculated for each position on the\nsample for which neither conductance nor XRF data was excluded. The mean of\nthese conductivities was returned to the optimizer (see below). In cases where all\npoints were discarded, a mean conductivity of 0 was reported.\nThe outlier kernel density exclusion method was performed by calculating\nGaussian kernel density estimates for the conductance and XRF data, normalizing\nthe density between 0 and 1, and rejecting data points with a kernel density below\n0.3. Bandwidths of 5 × 10−3 μΩ−1 m−1 and 5 × 103 cps were used for the\nconductance and XRF data, respectively.\nAutonomous workflow step 8: algorithmic experiment planning. The experiment parameters for each optimization experiment performed on the autonomous\nlaboratory were determined by the qEHVI55 multiobjective Bayesian optimization\nalgorithm. In brief, this algorithm proposes experiments expected to increase the\narea underneath the Pareto front by the largest amount. More formally, the\nalgorithm proposes a batch of q experiments (q = 1 here, but q could be increased\nto exploit parallelized experimentation), which are collectively expected to increase\nthe hypervolume between the Pareto front and a reference point by the largest\namount. The hypervolume is a generalization of volume to an arbitrary number of\ndimensions; this generalization supports optimization with more than two objectives. The reference point must be specified prior to the optimization and specifies a\nminimum value of interest for each objective.\nThe algorithm involves two major conceptual steps: modeling the objectives\nfrom data and proposing the next experiment. In the configuration used here, each\nobjective is assumed to be independent and is modeled with an independent\ngaussian process (see Supplementary Figs. 5 and 6). Based on the models for each\nobjective, the expectation value of the hypervolume improvement associated with\nany candidate experiment can be computed; the candidate experiment with the\nlargest expected hypervolume improvement is selected. We ran the qEHVI\nalgorithm using the implementation available in the open-source BoTorch\nBayesian optimization library68,69. We used a temperature reference point at the\nupper limit of the experiment (280 °C) so that any outcome with a processing\ntemperature below this upper limit would be targeted. We used a dynamic\nconductivity reference point set to 5% of the running observed maximum\nconductivity. This dynamic reference point ensured that the optimization would\nidentify Pareto-optimal outcomes over a wide range of conductivity values and did\nnot require prior knowledge of the scale of conductivity values expected. We used\nheteroskedastic Gaussian processes to model both the conductivity and the\ntemperature68. We assigned each conductivity point an uncertainty equal to 20% of\nits value, which is comparable to the repeatability of the experiment\n(Supplementary Fig. 13). Zero uncertainty was assigned to the temperature values,\nwhich were manipulated rather than responding variables and were trivial\nto model.\nCalibration of XRF signal against reference samples. To enable palladium film\nthickness to be estimated from the XRF signal, a calibration procedure was performed on sputtered palladium reference samples having four different nominal\nthicknesses (10, 50, 100, and 250 nm). These samples were characterized by profilometry and XRF. A linear relationship between the film thickness and the XRF\ncounts was observed (see Supplementary Fig. 2). This relationship was used to\nestimate the thickness of each sample from the XRF data.\nThe reference samples were sputtered onto clean glass microscope slides (see\ncleaning procedure above) using a Univex 250 sputter deposition system with a DC\nmagnetron source at 100 W and an argon working pressure of 5 × 10−6 bar. The\ndeposition chamber base pressure is 5 × 10−9 bar. Films were deposited after 1 min\nof pre-sputtering. The substrate holder rotated at 10 rpm. Nominal film thickness\nwas monitored using a quartz crystal microbalance mounted in the sputter\nchamber. A 2-inch diameter palladium sputter target was used (99.99%, ACI\nAlloys). Step edges for profilometry were obtained by placing strips of Kapton™\ntape onto the substrates prior to sputtering and removing these after sputtering.\nThe substrates were rinsed with acetone and IPA to remove any Kapton™ tape\nresidue prior to performing profilometry.\nProfilometry was performed on the reference samples using a Bruker DektakXT\nstylus profilometer. XRF was performed on the reference samples using the same\nsettings used for the drop-casted samples during the optimization campaigns (see\nabove).\nDeposition and characterization of spray-coated samples. The spray coater was\nbuilt from an ultrasonic nozzle (Microspray, USA) mounted to a custom motorized\nXYZ gantry system (Zaber Technologies Inc., Canada) above a hot plate (PC-420D,\nCorning, USA). Precursor ink was fed to the nozzle by a syringe pump (cavro\ncentris pump PN: 30098790-B, Tecan Trading AG, Switzerland). The ultrasonic\nspray nozzle was operated at 3 W and 120 kHz. For each recipe, a total of 700 µL of\nprecursor was sprayed onto a glass substrate (75 mm × 25 mm × 1 mm microscope\nslides; VWR catalog no. 16004-430) placed on a custom aluminum fixture\nmounted to the hotplate. Approximate substrate temperatures were measured\nusing a thermocouple attached to a glass substrate with thermal cement. This\ninstrumented substrate was placed at a position on the hotplate fixture symmetrical\nto the position where the substrates to be coated were placed. The hotplate power\nwas adjusted until the steady-state temperature of the instrumented substrate was\nwithin 4 °C of the desired temperature before spray coating each of the recipes\nreported here. To achieve consistent thermal contact between the substrates and\nthe hotplate fixture, both the instrumented substrate and substrate to be coated\nwere affixed to the hotplate with thermal paste (TG-7, Thermaltake Technology\nCo., Taiwan). The spray coater nozzle speed was 5.1 mm s−1, the nozzle-tosubstrate distance was 15 mm, the spray flow rate was 2 µL s−1, and the carrier gas\nflow rate was 7 L min−1. When spraying, the nozzle moved in a serpentine pattern\nconsisting of twelve 50 mm lines with 25 mm spacing (see an illustration of the\npattern in Supplementary Fig. 14). The coating on each sample was produced by\nrepeating this spray pattern three times with no delay between passes. After spray\ncoating, the samples were left to anneal on the hot plate for 5 min.\nThe spray-coated palladium films were characterized at 26 locations on a 2 × 13\ngrid within an 8 × 20 mm region of interest at the center of the film (see\nSupplementary Fig. 14). The amount of palladium at each location was measured\nusing the XRF microscope and converted to a film thickness estimate by applying\nthe same calibration method used for the drop-cast films. The film conductance at\neach location was measured using the 4-point probe system on the robot described\nabove. The film conductivity was calculated at each of the 26 measurement\nlocations by combining the 4-point probe conductance and XRF film thickness\nvalues for that location using Eq. (1). The mean and standard deviations of the 26\nresulting thickness and conductivity values are reported for each film in\nSupplementary Table 3.\nComputer simulations of optimization algorithm performance. Computer\nsimulations were used to study the performance of the qEHVI algorithm for\noptimizing the combustion synthesis experiments. A model of the experimental\nresponse surface was built from the experimental data. Experimental optimizations\nwere then simulated by sampling the model using grid search, random search,\nSobol sampling, and the qEHVI and qParEGO algorithms. Optimization performance was quantified with and without simulated experimental noise. The performance of qEHVI relative to random sampling was quantified using the\nacceleration factor (AF) and enhancement factor (EF) metrics59. These simulation\nprocedures are described in more detail below.\nModels of the experimental response surface and noise. Gaussian process\nregression was used to create a model of the experimental response surface using\nthe combined data from all four optimization campaigns. This model predicts the\nexperimental outputs (i.e., annealing temperature and conductivity) from the\nexperimental inputs (i.e., fuel-to-oxidizer ratio, fuel blend, total concentration, and\nannealing temperature). Our model is composed of two separate Gaussian processes, as implemented by the scikit-learn Python package67. Each Gaussian process is regressed on a single experimental output (i.e., either temperature or\nconductivity) and all four of the experimental inputs. The kernels used for the\nconductivity (kcond) and temperature (ktemp) models are:\nkcond x; x0 ð Þ ¼ klin x; x0 ð Þ ´ kSE x; x0 ð Þ þ knoise x; x0 ð Þ; ð2Þ\nktemp x; x0 ð Þ¼ klin x; x0 ð Þ ´ kSE x; x0 ð Þ\n; ð3Þ\nknoise x; x0 ð Þ¼ noise if x ¼ x0\nelse 0; ð4Þ\nwhere klin is a constant kernel, kSE is a squared exponential kernel, and knoise is a\nwhite noise kernel, and * indicates that the lengthscale of the kernel is fixed to 1.\nThe four types of input data and two types of output data were each normalized\nprior to training the model. To simplify the optimization to be strictly a\nmaximization problem, the temperature values (which must be minimized) were\nmultiplied by negative one. The leave-one-out cross-validation residuals (LOOCV; Supplementary Figs. 4, 9, and 10 and Supplementary Table 4) are comparable to\nthe measured experimental uncertainties (Supplementary Table 1). We also plotted\nthe LOOCV residuals as a function of each input (Supplementary Fig. 6), each\nmodeled output (Supplementary Fig. 7), and sampling order (Supplementary\nFig. 8) and observed that the distribution of the residuals was largely random.\nFor the simulations with no noise, the model posterior means were used directly\nto represent the experiment. For simulations with experimental noise, noisy\nconductivity values were simulated by randomly sampling a modified\nMaxwell–Boltzmann distribution. First, the Maxwell–Boltzmann distribution was\nflipped across the y-axis by negating the x term. Second, the mean of this\nMaxwell–Boltzmann distribution was set to the noiseless model posterior mean.\nFinally, the variance of the Maxwell–Boltzmann distribution was set to be equal to\nthe noise level (or variance) of the white noise kernel. We chose to employ\nMaxwell–Boltzmann noise to model the experimental noise because of the\ntendency of drop-casted samples to exhibit a wide range of downwards deviations\nin the apparent conductivity due to the poor sample morphology.\nThe Maxwell–Boltzmann probability density function is\nPBð Þ¼ x\nffiffiffi\nπ\n2\nr x2exp x2\n2a2\n \u0004\na3 ; ð5Þ\nwhere a is the distribution parameter. Since we set the variance of\nMaxwell–Boltzmann distribution (σ2\nB) equal to the white noise kernel noise level\n(σ2\nnoise)\nσ2\nnoise ¼ σ2\nB ¼ a2ð3π  8Þ\nπ : ð6Þ\nWe computed the distribution parameter for the Maxwell–Boltzmanndistributed simulated experimental noise as:\na ¼\nffiffiffiffiffiffiffiffiffiffiffiffiffi\nπσnoise\n3π  8\nr\n: ð7Þ\nIf subtracting the Maxwell–Boltzmann noise from the posterior mean resulted\nin a value less than zero, the noisy model value was set to zero.\nSampling strategies. To compare the performance of closed-loop and open-loop\napproaches, several sampling strategies (grid search, random search, Sobol sampling, and the qEHVI and qParEGO algorithms) were used to sample both the\nnoise-free and noisy experimental models. Random sampling was performed by\ngenerating samples from a uniform distribution across the entire normalized input\nspace. Sobol sampling was performed with a scrambling technique such that each\nSobol sequence is unique to yield a statistically meaningful distribution of\noptimizations70. qEHVI and qParEGO are initiated with ten scrambled Sobol\npoints. The qEHVI algorithm was configured as it was for the physical experiments\ndetailed above. The qParEGO algorithm was configured using the default settings,\nexcept for the reference point which was configured in the same way done for\nqEHVI. The complete benchmarking results are shown in Supplementary Fig. 11.\nSimulated optimization campaigns. The performance of each sampling strategy\n(grid, random, Sobol, qParEGO, and qEHVI) was determined both with and\nwithout experimental noise. Each simulated optimization campaign was performed\nfor 1000 replicates and 100 experimental iterations, except for random which was\nperformed for 100,000 iterations for use in the acceleration calculations (shown in\nFig. 4b). If an optimization algorithm produced an error during optimization, then\nthat replicate was removed and repeated.\nPareto front and hypervolume. The Pareto front is defined by the set of samples\nfor which no other sample simultaneously improves all the objectives. When\nassessing the performance of a simulation, the hypervolume was computed using\nthe least desirable value of each objective function (the nadir objective vector) as\nthe reference point (i.e., zero conductivity and 280 °C temperature). This reference\npoint was held constant for evaluating all of the simulated optimization campaigns.\nWe assessed the performance of the noisy optimizations such that the only difference between the noisy and noise-free optimizations was the information provided to the optimization algorithm. To perform this assessment, we followed the\nprocedure described by Bakshy and coworkers58 wherein the hypervolume for\noptimizations using the noisy experimental model were calculated from the\nequivalent point from the noiseless model. Since each objective of the model is\nnormalized to the range [0, 1], the hypervolume of the model is in the range [0, 1].\nFor each simulated optimization campaign, the normalized hypervolume was\ncalculated at each iteration. When calculating acceleration and enhancement factors, each of the 1000 simulated qEHVI campaigns was compared to each of the\n1000 simulated random campaigns, resulting in 1,000,000 comparisons.\nCalculation of acceleration and enhancement factor. The acceleration factor\nquantifies how much faster one sampling technique is than another (Eq. 5). For\nexample, if sampling technique B requires 40 samples to reach the performance\nattained by technique A after 20 samples, the acceleration factor of A relative to B\nat 20 samples is 2.\nAFA:B na\n \u0004 ¼ nb\nna\n;\ns:t: PB nb\n \u0004 ≥ PA na\n \u0004; min nb; ð8Þ\nwhere AFA:B na\n \u0004 is the acceleration of technique A with respect to B at na samples,\nand PiðnÞ is the performance of technique i at n samples. Note that it is possible for\nsampling technique A to outperform B such that there exists no value of nb where\nPB ≥ PA. In these cases, more samples with technique B are required to make the\ncomparison, otherwise AFA:B is not calculable. If AFA:B is not calculable, then a\nlower bound acceleration factor is calculated by assuming that the slow sampling\ntechnique would beat the fast sampling technique if it observed one more sample.\nThe acceleration factor in Fig. 4b was reported until these lower bound estimates\ncompose more than 25% of all of the acceleration comparisons.\nThe enhancement factor of one sampling technique with respect to another for\na given number of samples is defined as the ratio of their performance values for\nthe same number of observations (Eq. 6). For example, if sampling technique A\nreaches a performance value of 7 after 20 samples, and technique B reaches a\nperformance value of 2 after 20 samples, the enhancement of technique A is 3.5 at\n20 samples.\nEFA:Bð Þ¼ n PAðnÞ\nPBðnÞ\n; ð9Þ\nwhere EFA:BðnÞ is the acceleration factor of sampling technique A with respect to B\nafter n samples. When PAð Þ¼ n 0 and PBð Þ¼ n 0, then EFA:Bð Þ¼ n 1. When\nPAð Þ n > 0 and PBð Þ n > 0, then EFA:Bð Þ n is not calculable. To compare the AF and EF\nfrom the repeated simulations, the median, geometric mean and interquartile range\nwere calculated.",
    "Data availability": "The raw and processed data generated by the self-driving laboratory in this study is\navailable at https://github.com/berlinguette/ada. All other data related to this paper is\navailable from the corresponding author upon request.",
    "Code availability": "All code used in this study was based on open-source Python packages listed in the\nsupplementary information.",
    "References": "1. Tabor, D. P. et al. Accelerating the discovery of materials for clean energy in\nthe era of smart automation. Nat. Rev. Mater. 3, 5–20 (2018).\n2. Stein, H. S. & Gregoire, J. M. Progress and prospects for accelerating materials\nscience with automated and autonomous workflows. Chem. Sci. 10, 9640–9649\n(2019).\n3. Häse, F., Roch, L. M. & Aspuru-Guzik, A. Next-generation experimentation\nwith self-driving laboratories. Trends Chem. 1, 282–291 (2019).\n4. MacLeod, B. P., Parlane, F. G. L., Brown, A. K., Hein, J. E. & Berlinguette, C. P.\nFlexible automation accelerates materials discovery. Nat. Mater. https://\ndoi.org/10.1038/s41563-021-01156-3 (2021).\n5. Ament, S. et al. Autonomous materials synthesis via hierarchical active\nlearning of nonequilibrium phase diagrams. Science Advances 7, eabg4930\n(2021).\n6. Bash, D. et al. Multi‐fidelity high‐throughput optimization of electrical\nconductivity in P3HT‐CNT composites. Adv. Funct. Mater. 2102606 (2021).\n7. Nikolaev, P. et al. Autonomy in materials research: a case study in carbon\nnanotube growth. npj Comput. Mater. 2, 16031 (2016).\n8. MacLeod, B. P. et al. Self-driving laboratory for accelerated discovery of thinfilm materials. Sci. Adv. 6, eaaz8867 (2020).\n9. Langner, S. et al. Beyond ternary OPV: high-throughput experimentation and\nself-driving laboratories optimize multicomponent systems. Adv. Mater. 32,\ne1907801 (2020).\n10. Li, J. et al. Autonomous discovery of optically active chiral inorganic\nperovskite nanocrystals through an intelligent cloud lab. Nat. Commun. 11,\n2046 (2020).\n11. Gongora, A. E. et al. A Bayesian experimental autonomous researcher for\nmechanical design. Sci. Adv. 6, eaaz1708 (2020).\n12. Burger, B. et al. A mobile robotic chemist. Nature 583, 237–241 (2020).\n13. Wang, L., Karadaghi, L. R., Brutchey, R. L. & Malmstadt, N. Self-optimizing\nparallel millifluidic reactor for scaling nanoparticle synthesis. Chem. Commun.\n56, 3745–3748 (2020). 14. Shimizu, R., Kobayashi, S., Watanabe, Y., Ando, Y. & Hitosugi, T.\nAutonomous materials synthesis by machine learning and robotics. APL\nMater. 8, 111110 (2020).\n15. Dave, A. et al. Autonomous discovery of battery electrolytes with robotic\nexperimentation and machine learning. Cell Rep. Phys. Sci. 1, 100264 (2020).\n16. Deneault, J. R. et al. Toward autonomous additive manufacturing: Bayesian\noptimization on a 3D printer. MRS Bull. https://doi.org/10.1557/s43577-021-\n00051-1 (2021).\n17. Hall, B. L. et al. Autonomous optimisation of a nanoparticle catalysed\nreduction reaction in continuous flow. Chem. Commun. https://doi.org/\n10.1039/d1cc00859e (2021).\n18. Krishnadasan, S., Brown, R. J. C., deMello, A. J. & deMello, J. C. Intelligent routes\nto the controlled synthesis of nanoparticles. Lab Chip 7, 1434–1441 (2007).\n19. Moore, J. S. & Jensen, K. F. Automated multitrajectory method for reaction\noptimization in a microfluidic system using online IR analysis. Org. Process\nRes. Dev. 16, 1409–1415 (2012).\n20. Walker, B. E., Bannock, J. H., Nightingale, A. M. & deMello, J. C. Tuning reaction\nproducts by constrained optimisation. React. Chem. Eng. 2, 785–798 (2017).\n21. Salley, D. et al. A nanomaterials discovery robot for the Darwinian evolution\nof shape programmable gold nanoparticles. Nat. Commun. 11, 2771 (2020).\n22. Epps, R. W. et al. Artificial chemist: an autonomous quantum dot synthesis\nbot. Adv. Mater. 32, e2001626 (2020).\n23. Christensen, M. et al. Data-science driven autonomous process optimization.\nCommun. Chem. 4, 1–12 (2021).\n24. Mekki-Berrada, F. et al. Two-step machine learning enables optimized\nnanoparticle synthesis. npj Comput. Mater. 7, 1–10 (2021).\n25. Abdel-Latif, K. et al. Self‐driven multistep quantum dot synthesis enabled by\nautonomous robotic experimentation in flow. Adv. Intell. Syst. 3, 2000245 (2021).\n26. Grizou, J., Points, L. J., Sharma, A. & Cronin, L. A curious formulation robot\nenables the discovery of a novel protocell behavior. Sci. Adv. 6, eaay4237 (2020).\n27. Schweidtmann, A. M. et al. Machine learning meets continuous flow\nchemistry: automated optimization towards the Pareto front of multiple\nobjectives. Chem. Eng. J. 352, 277–282 (2018).\n28. Cao, L. et al. Optimization of formulations using robotic experiments driven\nby machine learning DoE. Cell Rep. Phys. Sci. 2, 100295 (2021).\n29. Maaliou, O. & McCoy, B. J. Optimization of thermal energy storage in packed\ncolumns. Sol. Energy 34, 35–41 (1985).\n30. Ahmadi, M. H., Ahmadi, M. A., Bayat, R., Ashouri, M. & Feidt, M. Thermoeconomic optimization of Stirling heat pump by using non-dominated sorting\ngenetic algorithm. Energy Convers. Manag. 91, 315–322 (2015).\n31. Li, Z., Pradeep, K. G., Deng, Y., Raabe, D. & Tasan, C. C. Metastable highentropy dual-phase alloys overcome the strength-ductility trade-off. Nature\n534, 227–230 (2016).\n32. Zhang, L. et al. Correlated metals as transparent conductors. Nat. Mater. 15,\n204–210 (2016).\n33. Park, H. B., Kamcev, J., Robeson, L. M., Elimelech, M. & Freeman, B. D.\nMaximizing the right stuff: The trade-off between membrane permeability and\nselectivity. Science 356, eaab0530 (2017).\n34. Oviedo, F. et al. Bridging the gap between photovoltaics R&D and\nmanufacturing with data-driven optimization. Preprint at https://arxiv.org/\n2004.13599v1 (2020).\n35. Liu, L. et al. Making ultrastrong steel tough by grain-boundary delamination.\nScience 368, 1347–1352 (2020).\n36. Ramirez, I., Causa’, M., Zhong, Y., Banerji, N. & Riede, M. Key tradeoffs\nlimiting the performance of organic photovoltaics. Adv. Energy Mater. 8,\n1703551 (2018).\n37. Kirkey, A., Luber, E. J., Cao, B., Olsen, B. C. & Buriak, J. M. Optimization of\nthe bulk heterojunction of all-small-molecule organic photovoltaics using\ndesign of experiment and machine learning approaches. ACS Appl. Mater.\nInterfaces 12, 54596–54607 (2020).\n38. Ren, S. et al. Molecular electrocatalysts can mediate fast, selective CO2\nreduction in a flow cell. Science 365, 367–369 (2019).\n39. Baumeler, T. et al. Minimizing the trade-off between photocurrent and\nphotovoltage in triple-cation mixed-halide perovskite solar cells. J. Phys.\nChem. Lett. 11, 10188–10195 (2020).\n40. Voskanyan, A. A., Li, C.-Y. V. & Chan, K.-Y. Catalytic palladium film\ndeposited by scalable low-temperature aqueous combustion. ACS Appl. Mater.\nInterfaces 9, 33298–33307 (2017).\n41. Mauritz, K. A. & Moore, R. B. State of understanding of nafion. Chem. Rev.\n104, 4535–4585 (2004).\n42. MacDonald, W. A. et al. Latest advances in substrates for flexible electronics. J.\nSoc. Inf. Disp. 15, 1075 (2007).\n43. Kim, M.-G., Kanatzidis, M. G., Facchetti, A. & Marks, T. J. Low-temperature\nfabrication of high-performance metal oxide thin-film electronics via\ncombustion processing. Nat. Mater. 10, 382–388 (2011).\n44. Hennek, J. W., Kim, M.-G., Kanatzidis, M. G., Facchetti, A. & Marks, T. J.\nExploratory combustion synthesis: amorphous indium yttrium oxide for thinfilm transistors. J. Am. Chem. Soc. 134, 9593–9596 (2012).\n45. Perelaer, J. et al. Printed electronics: the challenges involved in printing\ndevices, interconnects, and contacts based on inorganic materials. J. Mater.\nChem. 20, 8446–8453 (2010).\n46. Li, D., Lai, W.-Y., Zhang, Y.-Z. & Huang, W. Printable transparent conductive\nfilms for flexible electronics. Adv. Mater. 30, 1704738 (2018).\n47. Cochran, E. A. et al. Role of combustion chemistry in low-temperature\ndeposition of metal oxide thin films from solution. Chem. Mater. 29,\n9480–9488 (2017).\n48. Wang, B. et al. Marked cofuel tuning of combustion synthesis pathways for\nmetal oxide semiconductor films. Adv. Electron. Mater. 5, 1900540 (2019).\n49. Plassmeyer, P. N., Mitchson, G., Woods, K. N., Johnson, D. C. & Page, C. J.\nImpact of relative humidity during spin-deposition of metal oxide thin films\nfrom aqueous solution precursors. Chem. Mater. 29, 2921–2926 (2017).\n50. Kumar, A., Wolf, E. E. & Mukasyan, A. S. Solution combustion synthesis of\nmetal nanopowders: copper and copper/nickel alloys. AIChE J. 57, 3473–3479\n(2011).\n51. Manukyan, K. V. et al. Solution combustion synthesis of nano-crystalline\nmetallic materials: mechanistic studies. J. Phys. Chem. C 117, 24417–24427\n(2013).\n52. Mitzi, D. Solution Processing of Inorganic Materials (Wiley, 2008).\n53. Cochran, E. A., Woods, K. N., Johnson, D. W., Page, C. J. & Boettcher, S. W.\nUnique chemistries of metal-nitrate precursors to form metal-oxide thin films\nfrom solution: materials for electronic and energy applications. J. Mater.\nChem. A 7, 24124–24149 (2019).\n54. Pujar, P., Gandla, S., Gupta, D., Kim, S. & Kim, M. Trends in low‐temperature\ncombustion derived thin films for solution‐processed electronics. Adv.\nElectron. Mater. 6, 2000464 (2020).\n55. Daulton, S., Balandat, M. & Bakshy, E. Differentiable Expected Hypervolume\nImprovement for Parallel Multi-Objective Bayesian Optimization. Advances in\nNeural Information Processing Systems 33 (eds. Larochelle, H. et al.)\n9851–9864 (Curran Associates, Inc., 2020).\n56. Knowles, J. ParEGO: a hybrid algorithm with on-line landscape\napproximation for expensive multiobjective optimization problems. IEEE\nTrans. Evol. Comput. 10, 50–66 (2006).\n57. Paria, B., Kandasamy, K. & Póczos, B. A Flexible Framework for MultiObjective Bayesian Optimization using Random Scalarizations. In Proceedings\nof The 35th Uncertainty in Artificial Intelligence Conference (eds. Adams, R.\nP. & Gogate, V.) 115 766–776 (PMLR, 2020).\n58. Daulton, S., Balandat, M. & Bakshy, E. Parallel Bayesian Optimization of\nMultiple Noisy Objectives with Expected Hypervolume Improvement.\nAdvances in Neural Information Processing Systems 34 (eds. Ranzato, M. et al.)\n(Curran Associates, Inc., 2021).\n59. Rohr, B. et al. Benchmarking the acceleration of materials discovery by\nsequential learning. Chem. Sci. 11, 2696–2706 (2020).\n60. Yu, X. et al. Spray-combustion synthesis: efficient solution route to highperformance oxide transistors. Proc. Natl Acad. Sci. USA 112, 3217–3222\n(2015).\n61. Matula, R. A. Electrical resistivity of copper, gold, palladium, and silver. J.\nPhys. Chem. Ref. Data 8, 1147–1298 (1979).\n62. Shi, Y. S. Electrical resistivity of RF sputtered Pd films. Phys. Lett. A 319,\n555–559 (2003).\n63. Hloch, H. & Wissmann, P. The electrical resistivity of thin pd films grown on\nSi(111). Phys. Status Solidi A 145, 521–526 (1994).\n64. Anton, R., Häupl, K., Rudolf, P. & Wißmann, P. Electrical and structural\nproperties of thin palladium films. Z. f.ür. Naturforsch. A 41, 665–670 (1986).\n65. Delima, R. S., Sherbo, R. S., Dvorak, D. J., Kurimoto, A. & Berlinguette, C. P.\nSupported palladium membrane reactor architecture for electrocatalytic\nhydrogenation. J. Mater. Chem. A 7, 26586–26595 (2019).\n66. Bernhardsson, E. & Freider, E. L. https://github.com/spotify/luigi.\n67. Pedregosa, F. et al. Scikit-learn: machine learning in Python. J. Mach. Learn.\nRes. 12, 2825–2830 (2011).\n68. Balandat, M. et al. BoTorch: a framework for efficient Monte-Carlo Bayesian\noptimization. Advances in Neural Information Processing Systems 33 (eds.\nLarochelle, H. et al.) 21524–21538 (Curran Associates, Inc., 2020).\n69. Bakshy, E. et al. Advances in Neural Information Processing Systems vol. 31\n(The MIT Press, 2018).\n70. Owen, A. B. Scrambling Sobol’ and Niederreiter–Xing Points. J. Complex. 14,\n466–489 (1998).",
    "Acknowledgements": "The authors are grateful to Natural Resources Canada’s Energy Innovation Program\n(EIP2-MAT-001) for financial support. The authors are grateful to the Canadian Natural\nScience and Engineering Research Council (RGPIN-2018-06748), Canadian Foundation\nfor Innovation (229288), Canadian Institute for Advanced Research (BSE-BERL-162173),\nand Canada Research Chairs for financial support. B.P.M., F.G.L.P., T.D.M. and C.P.B.\nacknowledge support from the SBQMI’s Quantum Electronic Science and Technology Initiative, the Canada First Research Excellence Fund, and the Quantum Materials and\nFuture Technologies Program. We would like to acknowledge the many open-source\nsoftware communities without whose efforts this project would not have been possible.\nPlease see the supplementary information for further details.",
    "Author contributions": "C.P.B. conceived and supervised the project. B.P.M., K.E.D. and F.G.L.P. designed and\nperformed the autonomous optimization experiments. M.B.R., K.O., C.W., K.E.D., O.P.,\nM.S.E., B.P.M. and F.G.L.P. developed the robotic hardware. M.S.E., O.P. and K.E.D.\ndeveloped and configured the robotic control software. F.G.L.P. and T.H.H. developed\nthe data analysis software with input from N.T., K.E.D. and B.P.M., F.G.L.P., M.M. and\nB.P.M. performed and analyzed the simulations. M.S.E. and B.P.M. configured the EVHI\noptimization algorithm and interfaced it with the self-driving laboratory. K.O., H.N.C.\nand C.C.R. developed the spray coater hardware and software. C.C.R. performed the\nspray coating experiments. N.T. performed additional data analysis. D.J.D. performed\nadditional experiments. All authors participated in the writing of the manuscript.",
    "Competing interests": "The authors declare no competing interests.",
    "Additional information": "Supplementary information The online version contains supplementary material available at https://doi.org/10.1038/s41467-022-28580-6.",
    "A 1.1": "Figure 1: A Pareto front diagram illustrating the concept of multiobjective optimization. The graph plots Objective B against Objective A. The blue curve represents the 'Pareto front of best possible materials,' while the stepped black line represents the 'Pareto front of best known materials.' [cite_start]A red arrow indicates that the self-driving laboratory, Ada, closes the gap between the suboptimal materials (gray area) and the theoretical limit [cite: 23, 44-52].",
    "A 1.2": "Figure 2a: Schematic of the Ada self-driving laboratory. It shows the physical layout containing two robots: a 4-axis robot (N9) for film synthesis and characterization, and a larger 6-axis robot (UR5e) for sample transfer. [cite_start]The workspace includes an annealing oven, solution mixing area, dropcasting station, substrate storage, and an XRF microscope [cite: 109-114].",
    "A 1.3": "Figure 2b: The autonomous experimental workflow steps. The process flows from mixing precursors -> dropcasting mixture -> imaging -> annealing -> performing XRF microscopy -> imaging -> measuring conductance -> calculating film conductivity -> planning the next experiment. [cite_start]Example images of the dropcasted precursor, XRF signal map, annealed sample, and conductance measurements are shown [cite: 115-119].",
    "A 1.4": "Figure 3a: Input space maps for combustion synthesis conditions. Scatter plots show the relationship between fuel blend, total concentration, and annealing temperature against the fuel-to-oxidizer ratio. [cite_start]Colored points indicate experimental outcomes on the Pareto front, while gray points represent suboptimal materials [cite: 188-193].",
    "A 1.5": "Figure 3b: Output space graph showing the trade-off between annealing temperature and conductivity. [cite_start]The plot displays empirical Pareto fronts from four separate optimization campaigns (colored lines/points), demonstrating the clear trade-off where higher conductivity requires higher annealing temperatures [cite: 194-196].",
    "A 1.6": "Figure 4: Quantification of algorithm benefit. (a) Normalized hypervolume vs. samples for qEHVI (with and without noise) compared to random search. (b) Acceleration factor of qEHVI relative to random search. (c) [cite_start]Enhancement factor of qEHVI relative to random search [cite: 267-271].",
    "A 1.7": "Figure 5: Low-temperature spray combustion synthesis apparatus and results. (a) Photo of the ultrasonic spray-coating nozzle and hotplate fixture. (b) Photograph of a resulting palladium film on a glass substrate. (c) [cite_start]XRF homogeneity map showing the palladium signal distribution across the film [cite: 282-287].",
    "A 1.8": "Figure 6: Conductivity comparison bar chart. It compares the conductivity of spray-coated palladium films (Recipe 1 at 191°C, Recipe 2 at 200°C, Recipe 3 at 226°C) identified by Ada against literature values for sputtered films and bulk palladium. [cite_start]The chart shows spray combustion films achieving conductivities comparable to sputtered films [cite: 331-334]."
  }
}