{
  "filename": "Mareev et al. - 2023 - Self-Adjusting Optical Systems Based on Reinforcement Learning.pdf",
  "metadata": {
    "title": "Self-Adjusting Optical Systems Based on Reinforcement Learning",
    "authors": [
      "Evgenii Mareev",
      "Alena Garmatina",
      "Timur Semenov",
      "Nika Asharchuk",
      "Vladimir Rovenko",
      "Irina Dyachkova"
    ],
    "arxiv_id": ""
  },
  "sections": {
    "Abstract": "Progress in the field of machine learning has enhanced the development of self-adjusting optical systems capable of autonomously adapting to changing environmental conditions. This study demonstrates the concept of self-adjusting optical systems and presents a new approach based on reinforcement learning methods. We integrated reinforcement learning algorithms into the setup for tuning the laser radiation into the fiber, as well as into the complex for controlling the laser-plasma source. That reduced the dispersion of the generated X-ray signal by 2-3 times through automatic adjustment of the position of the rotating copper target and completely eliminated the linear trend arising from the ablation of the target surface. The adjustment of the system was performed based on feedback signals obtained from the spectrometer, and the movement of the target was achieved using a neural network-controlled stepper motor. As feedback, the second harmonic of femtosecond laser radiation was used, the intensity of which has a square root dependence on the X-ray yield. The developed machine learning methodology allows the considered systems to optimize their performance and adapt in real time, leading to increased efficiency, accuracy, and reliability.",
    "Introduction": "Nowadays, neural networks are finding increasing applications in optics and photonics. In the earlier works of machine learning, genetic algorithms were primarily used for pattern recognition, image reconstruction, aberration correction, or optical component design. Subsequent studies focused on the analysis of large datasets and inverse problems, where the superior ability of machine learning to classify data, uncover hidden structures, and handle a large number of degrees of freedom led to significant breakthroughs. Neural networks have achieved great success in the design of nanomaterials, cell classification, super-resolution microscopy, quantum optics, and optical communications. In addition to their application in general data processing, machine learning methods have the potential to control ultrafast photonics technologies of the next generation. This is due to the growing demand for adaptive control and self-adjustment of laser systems, as well as the fact that many ultrafast phenomena in photonics are nonlinear and multidimensional, with dynamics highly sensitive to noise. Although advances in measurement techniques have led to significant developments in experimental methods, recent research has shown that machine learning algorithms provide new ways to identify coherent structures in large sets of noisy data and potentially determine fundamental physical models and equations based on the analysis of complex time series. Neural networks can also greatly facilitate and automate the alignment process of complex optical systems such as femtosecond oscillators. Machine learning with reinforcement has recently been used for this purpose. For example, it has been used for mode synchronization in femtosecond and picosecond oscillators, seed generation for free-electron lasers, soliton and chaos control in laser systems, and laser processing of silicon. In any case, machine learning provides the opportunity to automate the adjustment of complex systems under changing external conditions. This has made this approach attractive for optimizing (increasing stability and signal level) the created laser-plasma source. The physics of X-ray generation in a laser-plasma source can be described as follows. When a laser pulse is focused on the surface of a solid target, the laser pulse energy is absorbed in the skin layer, generating laser-induced plasma with a temperature of several hundred electron volts and a solid density. During this short period, X-ray radiation is generated, as electrons cannot transfer a significant portion of their energy back to the lattice. These fast electrons, arising from the interaction of the incident laser radiation with the plasma, lead to the generation of characteristic lines as the electron vacancy in the inner shell is filled from the outer shell. To achieve a high X-ray flux, it is necessary to tightly focus the laser pulse, resulting in a focal spot size of a few micrometers, making the setup extremely sensitive to target position. Therefore, target vibrations modulate the X-ray pulse. Additionally, due to the high intensity, surface ablation (removal of surface material) occurs, resulting in the reduction of the diameter of the rotating target over time, causing the focus to drift away from the target surface. As a result, the X-ray signal becomes unstable over time, and constant target-position adjustment is required due to target ablation. Therefore, the main aim of this study was to develop an experimental setup based on reinforcement learning that would stabilize and maximize the amplitude of the X-ray signal generated in a laser-plasma source when ultrashort laser pulses are focused onto the surface of a rotating copper target. Additionally, the neural network created can be used for automatic control of the laser pulse propagation direction.",
    "Materials and Methods": "Experimental Setup: In the experiments, a femtosecond ytterbium fiber laser ANTAUS-10W-40u/250K with a wavelength of 1030 nm and an average power of up to 20 W was used. The pulse repetition rate was 2.0 MHz, with a maximum pulse energy of 10 µJ and a laser pulse duration of approximately 280 fs. The laser radiation was focused onto the end of a rotating and vertically cyclically displaced copper cylinder using a microscopic objective PAL-20-NIR-HR-LC00 with a focal length of 10 mm. A target with a polished side surface was mounted on a motor shaft taken from a hard disk. The vibrations of the rotating surface on the shaft did not exceed 2 µm. This displacement algorithm allowed a single target to be operated for at least 5 h—during this time interval the dispersion of the X-ray intensity did not exceed 15%. To prevent deposition of ablated particles on the focusing optics, a compressed air blowing system was assembled in the exposure area. X-ray radiation was measured using a single-channel scintillation detector SCSD-4 placed 13 cm away from the target. The focus position relative to the target was controlled based on the intensity of the X-ray radiation. The second harmonic signal was focused into the HR USB4000 fiber spectrometer. The rotating target was mounted on a motorized 5-axis table controlled by a WiFi2Duet stepper motor driver. Signal collection was fully automated using LabVIEW. Neural Network Architecture: The developed setup is based on the DQN learning algorithm. Deep Q-Network (DQN) is a popular algorithm used in reinforcement learning, which combines the Q-learning algorithm with deep neural networks to train an agent with optimal action strategies in a given environment. The DQN algorithm was implemented based on two linear layers, each consisting of 1024 neurons. The training was performed on an Nvidia RTX 3070 graphics card. The training parameters were set as follows: memory size of 100,000 elements, batch size of 1024 elements, learning rate of 10^-4, Adam optimizer, MSE loss error criterion, and error decay rate of 5x10^-4. Construction of the Reward Function: The reward function was calculated as follows: -3 if the neural network suggests leaving the movement area; -1*(I_{t-1}-I_t)+(I_t-I_max)/I_max if the feedback amplitude decreases; (I_{t-1}-I_t)+(I_t-I_max)/I_max if the feedback amplitude increases; 0.5 if the pause occurs within the range of 0.9 I_max-I_max; -(I_t-I_max)/I_max if the pause occurs within the range of 0.9 I_max-I_max (to avoid stopping outside the optimum).",
    "Results and Discussion": "Feedback Signal Selection: From a practical standpoint, the key parameters of a laser-plasma X-ray source are the X-ray flux, source size, stability of the X-ray signal, and ease of use. In our setup, the continuous movement of the target ensures that its time of usage is practically unlimited. However, the X-ray yield linearly decreases over time due to the ablation of the target surface by femtosecond laser pulses, and beats of the rotating target introduce oscillations in the X-ray signal. The square root dependence of the second harmonic (SH) on X-ray flux provides an opportunity to utilize the SH as feedback for reinforcement learning. Checking the Operation and Stability of the Neural Network in the Sandbox: Initially, the neural network was tested without being connected to external sensors and control elements. The conducted performance evaluation demonstrated that the model maintains stability regardless of the initial positions and even when subjected to linear drift speeds up to four times higher than the training speeds. Coupling the Laser Pulse into a Fiber Using Reinforcement Machine Learning: The next modeling task involved coupling light into the fiber. For this purpose, the neural network was modified to perform movements in two coordinates. Figure 5 illustrates the results of the neural network's operation in two different regimes: one where the maximum amplitude was not initially specified, and one where it was. The best convergence and stability of the neural network are achieved when the feedback signal is initially different from zero. Stabilising the Intensity of the X-ray Source: When optimizing X-ray pulse generation, the main objectives were compensating for target oscillations and addressing the linear drift caused by target ablation. The conducted validation demonstrates a significant reduction in X-ray signal oscillations by 2-3 times and effective compensation of the linear trend.",
    "Conclusions": "In conclusion, the optimization of laser-plasma X-ray sources using reinforcement learning techniques has shown promising results in improving stability and performance. Through the adjustment of the laser focus position, the X-ray signal output can be enhanced and stabilized. The incorporation of reinforcement learning algorithms allows adaptive optimization, compensating for target oscillations, linear drift, and other effects that may impact X-ray signal generation. The validation process demonstrated the effectiveness of reinforcement learning in reducing X-ray signal oscillations and compensating for linear trends during laser ablation. By carefully selecting learning parameters and ensuring a sufficient number of training iterations, stability and robustness can be achieved. Further research and experimentation in this field hold great potential for advancing the performance and reliability of laser-plasma X-ray sources, benefiting various applications such as material analysis, medical imaging, and industrial processes.",
    "Data availability": "The code is open sourced and can be found at https://github.com/EvgMar/X_ray_Al.git. Data underlying the results presented in this paper are not publicly available at this time but may be obtained from the authors upon reasonable request.",
    "A 1.1": "Figure 1: Experimental setup. The laser pulse beam is tightly focused on the surface of the rotated Cu target, which leads to the generation of the X-ray. The sample is inserted inside the X-ray beam, and transmitted through the sample X-ray beam registered by the X-ray detector. In addition to the X-ray, the second harmonic (515 nm) is generated during laser-matter interaction. The second harmonic is collimated by the objective and transmitted to the spectrometer. The second harmonic is used as a feedback for the machine learning algorithm. Based on the signal, the Cu target location is changed by the motorized 5-axis stepper motor controlled by the driver.",
    "A 1.2": "Figure 2: Schematic representation of the algorithm. The agent receives information about environment (feedback and current coordinate) and reward. Based on the neural network (2 layers of 1024 neurons) it chooses one action: move left, move right or wait. The environment changes and the loop starts again.",
    "A 1.3": "Figure 3: Dependence of second harmonic intensity on X-ray photon flux at repetition frequencies of 2 MHz. The solid line shows square root dependence.",
    "A 1.4": "Figure 4: Results of the neural network performance in a sandbox. The black line represents the signal variation without the work of the neural network, the red line represents the signal variation with the working neural network, and the blue line represents the change in coordinates.",
    "A 1.5": "Figure 5: Working regime of neural network. The black line shows the intensity observed by spectrometer, red line shows stepper motor coordinate. (a) \"Slow\" regime, when no information about intensity level was given. (b) \"Fast\" regime, when the approximate maximum intensity was transmitted to the neural network. (c) The heat map of the intensity distribution for all x and y coordinates. The dashed line indicates the path that the network used to find optimal location pair (x,y).",
    "A 1.6": "Figure 6: Comparison of operating regimes of the laser-plasma source with and without the reinforcement learning-based automatic target position adjustment. (a) Dynamics of the X-ray signal variation in full scale. (b) Enlarged view of the graph in (a). The dotted lines show the linear trend due to laser ablation."
  }
}