{
  "filename": "Szymanski et al. - 2023 - An autonomous laboratory for the accelerated synthesis of novel materials.json",
  "metadata": {
    "title": "An autonomous laboratory for the accelerated synthesis of novel materials",
    "authors": [
      "Nathan J. Szymanski",
      "Bernardus Rendy",
      "Yuxing Fei",
      "Rishi E. Kumar",
      "Tanjin He",
      "David Milsted",
      "Ted H. Haley",
      "Matthew J. McDermot",
      "Max Gallant",
      "Ekin Dogus Cubuk",
      "Amil Merchant",
      "Haegyeom Kim",
      "Anubhav Jain",
      "Christopher J. Barte",
      "Kristin Persson",
      "Yan Zeng",
      "Gerbrand Ceder"
    ],
    "arxiv_id": ""
  },
  "sections": {
    "Abstract": "To close the gap between the rates of computational screening and experimental\nrealization of novel materials1,2\n, we introduce the A-Lab, an autonomous laboratory\nfor the solid-state synthesis of inorganic powders. This platform uses computations,\nhistorical data from the literature, machine learning (ML) and active learning to plan\nand interpret the outcomes of experiments performed using robotics. Over 17 days of\ncontinuous operation, the A-Lab realized 41 novel compounds from a set of 58 targets\nincluding a variety of oxides and phosphates that were identified using large-scale ab\ninitio phase-stability data from the Materials Project and Google DeepMind. Synthesis\nrecipes were proposed by natural-language models trained on the literature and\noptimized using an active-learning approach grounded in thermodynamics. Analysis\nof the failed syntheses provides direct and actionable suggestions to improve current\ntechniques for materials screening and synthesis design. The high success rate\ndemonstrates the effectiveness of artificial-intelligence-driven platforms for\nautonomous materials discovery and motivates further integration of computations,\nhistorical knowledge and robotics.",
    "Introduction": "Although promising new materials can be identified at scale using\nhigh-throughput computations, their experimental realization is\noften challenging and time-consuming. Accelerating the experimental segment of materials discovery requires not only automation but\nautonomy—the ability of an experimental agent to interpret data and\nmake decisions based on it. Pioneering efforts have demonstrated\nautonomy in several aspects of materials research, including robotic\nand Bayesian-driven optimization of carbon nanotube yield3,4\n, photovoltaic performance5\n and photocatalysis activity6\n. In contrast to conventional ML algorithms used for optimization, human researchers\nbenefit from a wealth of background knowledge that informs their\ndecision-making, and it is increasingly recognized7–9\n that autonomy\nwill require a fusion of encoded domain knowledge, access to diverse\ndata sources and active learning.\nHere we present the A-Lab, an autonomous laboratory that integrates\nrobotics with the use of ab initio databases, ML-driven data interpretation, synthesis heuristics learned from text-mined literature data and\nactive learning to optimize the synthesis of novel inorganic materials\nin powder form. Although autonomous workflows based on liquid\nhandling have been demonstrated in organic chemistry10–13, the A-Lab\naddresses the unique challenges of handling and characterizing solid\ninorganic powders. These often require milling to ensure good reactivity between precursors, which can have a wide range of physical properties related to differences in their density, flow behaviour, particle\nsize, hardness and compressibility. The use of solid powders is well\nsuited for manufacturing and technological scaleup, and the approach\nof the A-Lab to synthesis produces multigram sample quantities that\nfacilitate device-level testing.\nGiven a set of air-stable target materials (that is, desired synthesis\nproducts whose yield we aim to maximize) screened using the Materials Project14, the A-Lab generates synthesis recipes using ML models\ntrained on historical data from the literature and then performs these\nrecipes with robotics. The synthesis products are characterized by X-ray\ndiffraction (XRD), with two ML models working together to analyse\ntheir patterns. When synthesis recipes fail to produce a high target\nyield, active learning closes the loop by proposing improved follow-up\nrecipes. Over 17 days of operation, the A-Lab successfully synthesized\n41 of 58 target materials that span 33 elements and 41 structural prototypes (Supplementary Fig. 1 and Supplementary Table 1). Inspection of\nthe 17 unobtained targets revealed synthetic as well as computational\nfailure modes, several of which could be overcome through minor\nadjustments to the lab’s decision-making. With its high success rate\nin validating predicted materials, the A-Lab showcases the collective\npower of ab initio computations, ML algorithms, accumulated historical\nknowledge and automation in experimental research.",
    "Autonomous materials-discovery platform": "The materials-discovery pipeline followed by the A-Lab is schematically\nshown in Fig. 1. All target materials considered in this work are new\nto the lab, that is, not present in the training data for the algorithms\nit uses to propose synthesis recipes, and 52 of the 58 targets have no previous synthesis reports, to the best of our knowledge (Methods).\nThe experiments reported in this study represent the first attempts by\nthe A-Lab to synthesize any of these targets. Each target is predicted to\nbe on or very near (<10 meV per atom) the convex hull formed by stable\nphases taken from the Materials Project14 and cross-referenced with an\nanalogous database from Google DeepMind. Because the A-Lab handles\nsamples in open air, we only considered targets that are predicted not\nto react with O2, CO2 and H2O (Methods).\nFor each compound proposed to the A-Lab, up to five initial synthesis\nrecipes are generated by a ML model that has learned to assess target\n‘similarity’ through natural-language processing of a large database\nof syntheses extracted from the literature15, mimicking the approach\nof a human to base an initial synthesis attempt on analogy to known\nrelated materials. A synthesis temperature is then proposed by a second ML model trained on heating data from the literature16 (Methods).\nIf these literature-inspired recipes fail to produce >50% yield for their\ndesired targets, the A-Lab continues to experiment using Autonomous\nReaction Route Optimization with Solid-State Synthesis (ARROWS3\n),\nan active-learning algorithm that integrates ab initio computed reaction energies with observed synthesis outcomes to predict solid-state\nreaction pathways17. Experiments are performed under the guidance\nof this algorithm until the target is obtained as the majority phase or\nall synthesis recipes available to the A-Lab are exhausted.\nThe A-Lab carries out experiments using three integrated stations for\nsample preparation, heating and characterization, with robotic arms\ntransferring samples and labware between them (Fig. 1 and Extended\nData Figs. 1 and 2). The first station dispenses and mixes precursor\npowders before transferring them into alumina crucibles. A robotic arm\nfrom the second station loads these crucibles into one of four available\nbox furnaces to be heated (Methods). After allowing the samples to\ncool, another robotic arm transfers them to the third station, where they\nare ground into a fine powder and measured by XRD. The operations of\nthe lab are controlled through an application programming interface,\nwhich enables on-the-fly job submission from human researchers or\ndecision-making agents (Extended Data Fig. 3).\nThe phase and weight fractions of the synthesis products are\nextracted from their XRD patterns by probabilistic ML models trained\non experimental structures from the Inorganic Crystal Structure Database (ICSD) following the methodology outlined in previous work18,19.\nBecause the target materials considered in this work have no experimental reports, their diffraction patterns are simulated from computed\nstructures available in the Materials Project and corrected to reduce\ndensity functional theory (DFT) errors (Supplementary Note 1). For\neach sample, the phases identified by ML are confirmed with automated\nRietveld refinement (Methods and Supplementary Note 2) and the\nresulting weight fractions are reported to the management server of\nthe A-Lab to inform subsequent experimental iterations, if necessary,\nin search of an optimal recipe with high target yield.",
    "Experimental synthesis outcomes": "Using the described workflow, the A-Lab synthesized 41 of the 58 target\ncompounds over 17 days of continuous experimentation, representing\na 71% success rate. We show in the next section that this success rate\ncould be improved to 74% with only minor modifications to the lab’s\ndecision-making algorithm, and further to 78% if the computational\ntechniques were also improved. The high success rate demonstrates\nthat comprehensive ab initio calculations can be used to effectively\nidentify new, stable and synthesizable materials. The outcome for all\n58 compounds is plotted in Fig. 2 against their decomposition energies\n(on a log scale), a common thermodynamic metric that describes the\ndriving force to form a compound from its neighbours on the phase diagram20 (Supplementary Fig. 2). A negative (positive) decomposition\nenergy indicates that a material is stable (metastable) at 0 K. Of the\ntargets considered in this work, 50 are predicted to be stable, whereas\nthe remaining eight are metastable but lie near the convex hull. Over\nthe range of decomposition energies considered, we do not observe a\nclear correlation between decomposition energy and whether a material was successfully synthesized.\nIn total, 35 of the 41 materials synthesized by the A-Lab were obtained\nusing recipes proposed by ML models trained on synthesis data from\nthe literature (Supplementary Note 3). These literature-inspired recipes\nwere more likely to succeed when the reference materials are highly\nsimilar to our targets (Supplementary Fig. 3), confirming that target\n‘similarity’ is a useful metric to select effective precursors21. At the\nsame time, precursor selection remains a highly nontrivial task, even\nfor thermodynamically stable materials. Despite 71% of targets eventually being obtained, only 37% of the 355 synthesis recipes tested by\nthe A-Lab produced their targets. This finding echoes previous work\nthat has established the strong influence of precursor selection on\nthe synthesis path, ultimately deciding whether it forms the target or\nbecomes trapped in a metastable state22–25.\nThe active-learning cycle of the A-Lab17 identified synthesis routes\nwith improved yield for nine targets, of which six had zero yield from\nthe initial literature-inspired recipes. Targets optimized with active\nlearning are indicated by the bars containing diagonal lines in Fig. 2.\nIn this framework, improved synthesis routes are designed using two\nhypotheses: (1) solid-state reactions tend to occur between two phases\nat a time (that is, pairwise)26–28 and (2) intermediate phases that leave\nonly a small driving force to form the target material should be avoided,\nas they often require long reaction time and high temperature22,23,29.\nThe A-Lab continuously builds a database of pairwise reactions\nobserved in its experiments—88 unique pairwise reactions (Supplementary Table 2) were identified from the synthesis experiments performed\nin this work. This database allows the products of some recipes to be\ninferred, precluding their testing; a recipe that yields an observed set\nof intermediates (already present in the lab’s database) need not be\npursued at higher temperatures, as the remaining reaction pathway is\nalready known (Fig. 3a,b). This can reduce the search space of possible\nsynthesis recipes by up to 80% when many precursor sets react to form\nthe same intermediates (Fig. 3e and Supplementary Notes 4 and 5). Furthermore, knowledge of reaction pathways can be used to give priority\nto intermediates with a large driving force to form the target, computed\nusing formation energies available in the Materials Project (Fig. 3c,d).\nFor example, the synthesis of CaFe2P2O9 was optimized by avoiding\nthe formation of FePO4 and Ca3(PO4)2, which have a small driving force\n(8 meV per atom) to form the target. This led to the identification of an\nalternative synthesis route that forms CaFe3P3O13 as an intermediate,\nfrom which there remains a much larger driving force (77 meV per atom)\nto react with CaO and form CaFe2P2O9, causing an approximately 70%\nincrease in the yield of the target (Supplementary Note 6).",
    "Barriers to synthesis": "Seventeen of the 58 targets evaluated by the A-Lab were not obtained\neven after its active-learning cycle. We identify slow reaction kinetics,\nprecursor volatility, amorphization and computational inaccuracy as\nfour broad categories of ‘failure modes’ that prevented the synthesis\nof these targets. The prevalence of each failure mode is shown in Fig. 4,\naccompanied by their affected targets. Sluggish reaction kinetics hindered 11 of the 17 failed targets, each\ncontaining reaction steps with low driving forces (<50 meV per atom;\nSupplementary Fig. 4). In principle, these targets can be made accessible\nby using a higher synthesis temperature, longer heating time, improved\nprecursor mixing or intermittent regrinding—standard procedures that\nare at present outside the domain of the A-Lab’s active-learning algorithm. As such, we manually reground the original synthesis products\ngenerated by the A-Lab and heated them to higher temperatures, which\nled to the successful formation of two further targets, Y3Ga3In2O12 and\nMg3NiO4, bringing our total success rate to 74% (Supplementary Note 7).\nOne could also use more reactive precursors to provide a greater driving\nforce to form the target, although our experiments were constrained\nto air-stable binary precursors that sometimes restricted the A-Lab’s\nchoice of synthesis routes to those forming highly stable intermediates. System modifications to enable multistep heating, intermediate\nregrinding and expanded precursor selection should improve the ability\nof the lab to adapt and overcome failed synthesis attempts.\nPrecursor volatility disrupted all synthesis experiments targeting\nCaCr2P2O9, causing a change in the net stoichiometry of its samples\n(Supplementary Note 8). This can be attributed to the use of ammonium phosphate precursors, NH4H2PO4 and (NH4)2HPO4, which proceed\nthrough a series of decomposition reactions and ultimately evaporate\nabove 450 °C (ref. 30). Still, recipes based on these precursors can succeed if the ammonium phosphate reacts with another precursor before\nits evaporation temperature, effectively locking the phosphate ions in\nthe solid state. For example, volatility does not seem to be an issue for\nthe Mn-containing phosphates targeted in this work, as each Mn oxides\nprecursor reacts with the ammonium phosphates at low temperature\n(<500 °C) to form Mn2(PO4)3 as an intermediate. This precursor behaviour can, in principle, be learned when sufficient pairwise reaction data\nhave been collected, after which the A-Lab may favour the selection of\nprecursors that trap in phosphate ions at low temperature and therefore\npreclude unwanted volatility.\nMelting of samples at high temperature inhibited the crystallization of one target, Mo(PO3)5, whose synthesis attempts produced\namorphous samples (Supplementary Fig. 5). Although the use of a\nmolten flux can sometimes improve reaction kinetics31, the formation\nof an amorphous state that is low in energy may reduce the driving\nforce for crystallization. Indeed, using the workflow outlined in ref. 32,\nwe identified amorphous configurations of Mo(PO3)5 with energies as\nlow as 61 meV per atom above the crystalline ground state, a finding\nthat is consistent with the widely reported glass-forming ability of\nphosphate-rich compounds33,34.\nSome failure modes result from inaccuracies in the computed stability of the target and therefore cannot be addressed by modifications\nto the experimental procedures. Fundamental-electronic-structure\nchallenges are probably affecting La5Mn5O16, as all the attempts to\nsynthesize this phase instead yielded LaMnO3, which DFT unexpectedly predicts to be highly unstable (120 meV per atom above the hull),\neven though it is widely reported in the literature to be experimentally\naccessible35. If the energy of LaMnO3 were lowered, consistent with\nits experimental stability, La5Mn5O16 would be destabilized (above\nthe hull). Errors in the computed energy of LaMnO3 may arise from\nits strong Jahn–Teller activity36, compositional off-stoichiometry37\nor the presence of f-states in La—all of which present challenges to\nconventional DFT. Problems with YbMoO4 were found to be because\nof a poor pseudopotential choice in the Materials Project that destabilizes the well-known oxide, Yb2O3, and it is likely that, in more accurate calculations, YbMoO4 is not stable. A similar lanthanide-related\nelectronic-structure problem may also be responsible for the failure\nto synthesize BaGdCrFeO6. These examples demonstrate the ability of\nthe A-Lab to provide important feedback to high-throughput computed\ndatasets. With improved calculations that exclude the computationally problematic compounds in this work, our total success rate would\nincrease to 78% (43/55 targets).",
    "Outlook": "In 17 days of closed-loop operation, the A-Lab performed 355 experiments and successfully realized 41 of 58 novel inorganic crystalline solids with diverse structures and chemistries. This unexpectedly high\nsuccess rate (71%) for the synthesis of computationally predicted compounds was achieved by integrating robotics with: (1) DFT-computed\ndata to survey the energetic landscape of precursors, reaction intermediates and final products; (2) heuristic suggestions for synthesis procedures obtained from ML models trained on text-mined synthesis data;\n(3) ML interpretation of experimental data; and (4) an active-learning\nalgorithm that improves on failed synthesis procedures. The study\nalso revealed several opportunities to enhance the lab’s active-learning\nalgorithm by addressing failures caused by slow reaction kinetics,\nwhich would enable an improved success rate of 74% with in-line\nsolutions.\nOur paper demonstrates that autonomous research agents can markedly accelerate the pace of materials research. Researchers initialized\nthe A-Lab by proposing 58 target materials, which were successfully\nrealized at a rate of >2 new materials per day with minimal human intervention. Such rapid discovery points to a vast landscape of opportunities in materials synthesis and development. Although this work\nfocused on a limited subset of all possible synthesis targets, many new\ncandidates await evaluation. As the breadth of ab initio computations\ncontinues to grow, so will this list of novel materials.\nAdvances in simulations, ML and robotics have intersected to enable\n‘expert systems’ that show autonomy as an emergent quality by the\nsum of its automated components. The A-Lab demonstrates this by\ncombining modern theory-driven and data-driven ML techniques\nwith a modular workflow that can discover novel materials with minimal human input. Lessons learned from continuing experiments can\ninform both the system itself and the greater community through\nsystematic data generation and collection. The systematic nature\nof the A-Lab provides a unique opportunity to answer fundamental\nquestions about the factors that govern the synthesizability of novel\nmaterials, serving as an experimental oracle to validate predictions\nmade on the basis of data-rich resources such as the Materials Project.\nIn future iterations of the platform, such an oracle may be expanded\nto investigate factors beyond synthesizability, including microstructure and device performance. Although our current success rate for\nthe synthesis of novel compounds is high, the remaining discrepancies between current predictions and their experimental outcomes\nis a crucial signal required to improve our understanding of materials\nsynthesis. 18. Szymanski, N. J., Bartel, C. J., Zeng, Y., Tu, Q. & Ceder, G. Probabilistic deep learning\napproach to automate the interpretation of multi-phase diffraction spectra. Chem. Mater.\n33, 4204–4215 (2021).\n19. Szymanski, N. J. et al. Adaptively driven X-ray diffraction guided by machine learning for\nautonomous phase identification. NPJ Comput. Mater. 9, 31 (2023).\n20. Bartel, C. J. Review of computational approaches to predict the thermodynamic stability\nof inorganic solids. J. Mater. Sci. 57, 10475–10498 (2022).\n21. He, T. et al. Similarity of precursors in solid-state synthesis as text-mined from scientific\nliterature. Chem. Mater. 32, 7861–7873 (2020).\n22. Miura, A. et al. Selective metathesis synthesis of MgCr2S4 by control of thermodynamic\ndriving forces. Mater. Horiz. 7, 1310–1316 (2020).\n23. Bianchini, M. et al. The interplay between thermodynamics and kinetics in the solid-state\nsynthesis of layered oxides. Nat. Mater. 19, 1088–1095 (2020).\n24. Aykol, M., Montoya, J. H. & Hummelshøj, J. Rational solid-state synthesis routes for\ninorganic materials. J. Am. Chem. Soc. 143, 9244–9259 (2021).\n25. Martinolich, A. J. & Neilson, J. R. Toward reaction-by-design: achieving kinetic control of\nsolid state chemistry with metathesis. Chem. Mater. 29, 479–489 (2017).\n26. Miura, A. et al. Observing and modeling the sequential pairwise reactions that drive\nsolid-state ceramic synthesis. Adv. Mater. 33, 2100312 (2021).\n27. Cordova, D. L. M. & Johnson, D. C. Synthesis of metastable inorganic solids with extended\nstructures. ChemPhysChem 21, 1345–1368 (2020).\n28. Malkowski, T. F. et al. Role of pairwise reactions on the synthesis of Li0.3La0.57TiO3 and the\nresulting structure–property correlations. Inorg. Chem. 60, 14831–14843 (2021).\n29. Todd, P. K. et al. Selectivity in yttrium manganese oxide synthesis via local chemical\npotentials in hyperdimensional phase space. J. Am. Chem. Soc. 143, 15185–15194\n(2021).\n30. Pardo, A., Romero, J. & Ortiz, E. High-temperature behaviour of ammonium dihydrogen\nphosphate. J. Phys. Conf. Ser. 935, 012050 (2017).\n31. Gupta, S. K. & Mao, Y. Recent developments on molten salt synthesis of inorganic\nnanomaterials: a review. J. Phys. Chem. C 125, 6508–6533 (2021).\n32. Aykol, M., Dwaraknath, S. S., Sun, W. & Persson, K. A. Thermodynamic limit for synthesis\nof metastable inorganic materials. Sci. Adv. 4, eaaq014 (2018).\n33. Bridge, B. & Patel, N. D. The elastic constants and structure of the vitreous system Mo-P-O.\nJ. Mater. Sci. 21, 1186–1205 (1986).\n34. Muñoz, F. & Sánchez-Muñoz, L. The glass-forming ability explained from local structural\ndifferences by NMR between glasses and crystals in alkali metaphosphates. J. Non-Cryst.\nSolids 503–504, 94–97 (2019).\n35. Norby, P., Krogh Andersen, I. G., Andersen, E. K. & Andersen, N. H. The crystal structure of\nlanthanum manganate(iii), LaMnO3, at room temperature and at 1273 K under N2. J. Solid\nState Chem. 119, 191–196 (1995).\n36. Kim, Y.-J., Park, H.-S. & Yang, C.-H. Raman imaging of ferroelastically configurable Jahn–\nTeller domains in LaMnO3. NPJ Quantum Mater. 6, 62 (2021).\n37. Alonso, J. A. et al. Non-stoichiometry, structural defects and properties of LaMnO3+δ with\nhigh δ values (0.11≤δ≤0.29). J. Mater. Chem. 7, 2139–2144 (1997).",
    "Online content": "1. Jain, A., Shin, Y. & Persson, K. A. Computational predictions of energy materials using\ndensity functional theory. Nat. Rev. Mater. 1, 15004 (2016).\n2. Sun, J. et al. Accurate first-principles structures and energies of diversely bonded\nsystems from an efficient density functional. Nat. Chem. 8, 831–836 (2016).\n3. Nikolaev, P. et al. Autonomy in materials research: a case study in carbon nanotube\ngrowth. NPJ Comput. Mater. 2, 16031 (2016).\n4. Chang, J. et al. Efficient closed-loop maximization of carbon nanotube growth rate using\nBayesian optimization. Sci. Rep. 10, 9040 (2020).\n5. MacLeod, B. P. et al. Self-driving laboratory for accelerated discovery of thin-film\nmaterials. Sci. Adv. 6, eaaz8867 (2020).\n6. Burger, B. et al. A mobile robotic chemist. Nature 583, 237–241 (2020).\n7. Ludwig, A. Discovery of new materials using combinatorial synthesis and high-throughput\ncharacterization of thin-film materials libraries combined with computational methods.\nNPJ Comput. Mater. 5, 70 (2019).\n8. Ren, Z. et al. Embedding physics domain knowledge into a Bayesian network enables\nlayer-by-layer process innovation for photovoltaics. NPJ Comput. Mater. 6, 9 (2020).\n9. Sun, S. et al. A data fusion approach to optimize compositional stability of halide\nperovskites. Matter 4, 1305–1322 (2021).\n10. Li, J. et al. Synthesis of many different types of organic small molecules using one\nautomated process. Science 347, 1221–1226 (2015).\n11. Kitson, P. J. et al. Digitization of multistep organic synthesis in reactionware for on-demand\npharmaceuticals. Science 359, 314–319 (2018).\n12. Coley, C. W. et al. A robotic platform for flow synthesis of organic compounds informed\nby AI planning. Science 365, eaax1566 (2019).\n13. Manzano, J. S. et al. An autonomous portable platform for universal chemical synthesis.\nNat. Chem. 14, 1311–1318 (2022).\n14. Jain, A. et al. Commentary: The Materials Project: a materials genome approach to\naccelerating materials innovation. APL Mater. 1, 011002 (2013).\n15. He, T. et al. Inorganic synthesis recommendation by machine learning materials similarity\nfrom scientific literature. Sci. Adv. 9, eadg8180 (2023).\n16. Huo, H. et al. Machine-learning rationalization and prediction of solid-state synthesis\nconditions. Chem. Mater. 34, 7323–7336 (2022).\n17. Szymanski, N. J., Nevatia, P., Bartel, C. J., Zeng, Y. & Ceder, G. Autonomous and dynamic\nprecursor selection for solid-state materials synthesis. Nat. Commun. https://doi.org/\n10.1038/s41467-023-42329-9 (2023).",
    "A 1.1": " Figure 1: Autonomous materials discovery with the A-Lab. The schematic illustrates the full pipeline where air-stable unreported targets are identified using DFT-calculated convex hulls from the Materials Project and Google DeepMind[cite: 774]. [cite_start]Synthesis recipes are proposed via machine learning models trained on literature[cite: 775]. [cite_start]These recipes are executed by a robotic laboratory automating powder dosing (1), sample heating (2), and product characterization with XRD (3), with robotic arms handling all transfers[cite: 776, 777]. [cite_start]Phase purity is assessed by ML models and Rietveld refinement, with active learning proposing new recipes if the target yield is low[cite: 790, 791].",
    "A 1.2": " Figure 2: Outcomes from targeted syntheses of DFT-predicted materials. [cite_start]This chart summarizes the results for 58 new compounds plotted against their decomposition energies on a log scale[cite: 869]. [cite_start]Blue bars indicate the 41 successfully synthesized targets, while red bars indicate the 17 failures[cite: 870]. [cite_start]Diagonal lines mark targets optimized via active learning, while others were obtained using literature-based ML proposals[cite: 871, 872]. [cite_start]Inset pie charts display the fraction of successful targets (41/58) and successful recipes (130/355)[cite: 883].",
    "A 1.3": " Figure 3: Active learning with pairwise reaction analysis. (a) [cite_start]The system analyzes failed attempts to determine occurred pairwise reactions[cite: 932]. (b) [cite_start]New precursors are suggested to substitute those involved in unfavorable reactions, avoiding redundant paths[cite: 933, 934]. (c) [cite_start]Successful precursor sets avoid unfavorable pairwise reactions[cite: 935]. (d) [cite_start]Free energy diagrams calculated from Materials Project data show the driving force at each reaction step[cite: 935, 936]. (e) [cite_start]A scatter plot depicts the efficiency of the active learning in identifying optimal paths or exhausting options relative to the search space size[cite: 937].",
    "A 1.4": " Figure 4: Barriers to the synthesis of materials predicted to be stable. [cite_start]The 17 failed targets are categorized by specific synthesis complications[cite: 1001]. [cite_start]Barriers are divided into experimental (blue, 13 targets) and computational (green, 3 targets) categories[cite: 1003, 1004]. [cite_start]Four failure modes are illustrated schematically: slow reaction kinetics (showing driving force vs reaction coordinate), precursor volatility (phase diagram), product amorphization (free energy G vs temperature T), and computational limitations of DFT at 0 K (free energy G vs composition)[cite: 1005].",
    "A 1.5": " Extended Data Figure 1: A-Lab hardware setup. [cite_start]A detailed photographic overview of the physical stations in the A-Lab[cite: 1289]. [cite_start]Panel (a) shows the precursor preparation station, including loading areas, powder dispensing, and mixing [cite: 1266-1273]. [cite_start]Panel (b) shows the heating station with robot arms and box furnaces [cite: 1274-1278]. [cite_start]Panel (c) shows the product handling and characterization station, featuring the X-ray diffractometer, ball dispenser, and shaker [cite: 1279-1288].",
    "A 1.6": " Extended Data Figure 2: Robotic installations for sample transfer in the A-Lab. [cite_start]Close-up images of the grippers on the UR5e robotic arms used for specific tasks: (a) sample preparation, (b) loading/unloading crucible racks, and (c) sample retrieval and characterization[cite: 1296]. [cite_start]Panel (d) shows the linear rail extending the robot's working envelope, and (e) shows the carousel for organizing samples [cite: 1297-1299].",
    "A 1.7": " Extended Data Figure 3: Communication protocols connecting each module in the A-Lab. [cite_start]A block diagram illustrating the local area network (LAN) connecting all hardware modules (furnaces, robots, XRD machine, balances) to a central control computer via RS-485, HTTP, and Socket connections[cite: 1325, 1326]. [cite_start]The control computer manages the workflow, while Arduino-controlled devices handle specific tasks like capping and dispensing[cite: 1306, 1315]."
  }
}